Revit 2026 API

# GradientBackgroundSettingsHorizonColor Property

---

The color of the horizon.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color HorizonColor { get; set; }
```
```vb
Public Property HorizonColor As Color
	Get
	Set
```
```cpp
public:
property Color^ HorizonColor {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member HorizonColor : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

GradientBackgroundSettings Class

Autodesk.Revit.DB Namespace